spec/cassettes/StripeWrapper/StripeWrapper_Customer/_create/valid_card/creates_a_new_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=8&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.1
      Authorization:
      - Bearer sk_test_aHOa6eoJJjnQPRDIPLzYaM70
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.1","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        source-11-xu 3.16.0-46-generic #62~14.04.1-Ubuntu SMP Tue Aug 11 16:27:16
        UTC 2015 x86_64 x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 23 Aug 2015 02:08:14 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6qUtt0j1GEtr5L
      Stripe-Version:
      - '2015-07-28'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16cnu6KUdRrCs1LrvgnT5gsC",
          "livemode": false,
          "created": 1440295694,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16cnu6KUdRrCs1LrC7Lql94q",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 8,
            "exp_year": 2016,
            "fingerprint": "kuqCAfzAp21fifIi",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "24.190.115.87"
        }
    http_version: 
  recorded_at: Sun, 23 Aug 2015 02:08:14 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: source=tok_16cnu6KUdRrCs1LrvgnT5gsC&plan=myflix_base&email=stripetest%40example.com&description=Monthly%20charge%20for%208%2F2015
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.1
      Authorization:
      - Bearer sk_test_aHOa6eoJJjnQPRDIPLzYaM70
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.1","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-linux","publisher":"stripe","uname":"Linux
        source-11-xu 3.16.0-46-generic #62~14.04.1-Ubuntu SMP Tue Aug 11 16:27:16
        UTC 2015 x86_64 x86_64 x86_64 GNU/Linux"}'
      Content-Length:
      - '129'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 23 Aug 2015 02:08:15 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2424'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6qUtvB3hKUsisK
      Stripe-Version:
      - '2015-07-28'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1440295694,
          "id": "cus_6qUtesRMiJVncS",
          "livemode": false,
          "description": "Monthly charge for 8/2015",
          "email": "stripetest@example.com",
          "shipping": null,
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_6qUtesRMiJVncS/subscriptions",
            "data": [
              {
                "id": "sub_6qUtNq75TLCnk5",
                "plan": {
                  "interval": "month",
                  "name": "Myflix Base Subscription",
                  "created": 1440293286,
                  "amount": 999,
                  "currency": "usd",
                  "id": "myflix_base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_descriptor": "Myflix Monthly Charge"
                },
                "object": "subscription",
                "start": 1440295694,
                "status": "active",
                "customer": "cus_6qUtesRMiJVncS",
                "cancel_at_period_end": false,
                "current_period_start": 1440295694,
                "current_period_end": 1442974094,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "tax_percent": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "sources": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_6qUtesRMiJVncS/sources",
            "data": [
              {
                "id": "card_16cnu6KUdRrCs1LrC7Lql94q",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 8,
                "exp_year": 2016,
                "fingerprint": "kuqCAfzAp21fifIi",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6qUtesRMiJVncS"
              }
            ]
          },
          "default_source": "card_16cnu6KUdRrCs1LrC7Lql94q"
        }
    http_version: 
  recorded_at: Sun, 23 Aug 2015 02:08:15 GMT
recorded_with: VCR 2.9.3
